{
    "ControlId": "general_auditLogs",
"Category": "Logs",
    "Description": "\r\n\r\n **Category**\r\n\r\nMonitoring, SIEM\r\n\r\n\r\n **Description**\r\n\r\nExporting Azure events allows building better situational awareness when building timelines and audit trails. More advanced analytics can also be performed on exported data (Log Analytics KQL, or other analytics languages)\r\n- Logs should be exported at least for period of 90 days, as this allows looking beyond the default 7-30 days of data retained.\r\n\r\n\r\n **Additional details**\r\n\r\nSource of information (Information from MS docs)\r\n\r\n- [Azure AD Logs](https://docs.microsoft.com/en-us/azure/active-directory/reports-monitoring/)\r\n- [Azure logs](https://docs.microsoft.com/en-us/azure/azure-monitor/essentials/platform-logs-overview#types-of-platform-logs)\r\n- [Azure Devops Logs](https://docs.microsoft.com/en-us/azure/devops/organizations/audit/azure-devops-auditing?view=azure-devops&tabs=preview-page#export-auditing-events)\r\n\r\n\r\n\r\n| Log | Layer | Description | status\r\n-|-|-|-\r\n📜 Azure Active Directory logs | Azure Tenant | Contains the history of sign-in activity and audit trail of changes made in the Azure Active Directory for a particular tenant. | &#9744;\r\n| 📜 Activity log |Azure Subscription | Provides insight into the operations on each Azure resource in the subscription from the outside (the management plane) in addition to updates on Service Health events. Use the Activity Log, to determine the what, who, and when for any write operations (PUT, POST, DELETE) taken on the resources in your subscription. There is a single Activity log for each Azure subscription. | &#9744;\r\n| 📜 Resource logs | Azure Resources | Provide insight into operations that were performed within an Azure resource (the data plane), for example getting a secret from a Key Vault or making a request to a database. The content of resource logs varies by the Azure service and resource type. <br> Resource logs were previously referred to as diagnostic logs. | &#9744;\r\n| 📜 Devops logs | Azure Devops Automation | Sending auditing data to other Security Incident and Event Management (SIEM) tools opens possibilities, such as alerting on specific auditing events, creating views on auditing data, and performing anomaly detection. It also allows you to store more than the 90-days worth of auditing data, which Azure DevOps keep| &#9744;\r\n\r\n\r\n**How logs are generated**\r\n\r\n![img](https://securecloud188323504.files.wordpress.com/2021/02/image-68.png?w=1024)\r\n\r\n\r\n"
}